---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.BuildingPadType
source: html/e980c1e0-c220-91bb-db95-f504d1e5f701.htm
---
# BuildingPadType Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.